Revit 2024 API
BuiltInFailures.IlluminationFailures.IESFileNotFoundWarning Property
 Estimated Illumination failed. IES file not found for lighting fixture.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId IESFileNotFoundWarning { get; }
Visual Basic
Public Shared ReadOnly Property IESFileNotFoundWarning As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ IESFileNotFoundWarning {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.IlluminationFailures Class
Autodesk.Revit.DB Namespace